In [3]:
def sun(a):
    x=0
    for i in a:
        x=x+i
    return x
b=(1,2,3,4,5)
y=sun(b)
print(y)

15

In [17]:
a=[1,2,3,4,5]
b=[60,7,82,19,120]
x=list(zip(a,b))
print(x)
x.sort( key = lambda x: x[0])
print(x)
x.sort(key=lambda x:x[1])
print(x)

[(1, 60), (2, 7), (3, 82), (4, 19), (5, 120)]
[(1, 60), (2, 7), (3, 82), (4, 19), (5, 120)]
[(2, 7), (4, 19), (1, 60), (3, 82), (5, 120)]

In [64]:
f=open("file2.txt","w")

In [46]:
f.write("hi my name is sarthak and i hate rahool shivdarshi")

50

In [63]:
f=open("file2.txt","r")
for x in f:
    print(x)
#print(f.read())

i hate rahool and i will kill rahool

In [58]:
f=open("file2.txt","w")
f.write("i hate rahool and i will kill rahool")
f.close()
f=open("file2.txt","r")
f.read()

'i hate rahool and i will kill rahool'

In [60]:
import os
if os.path.exists("file1.txt"):
    os.remove("file1.txt")
else:
    print("sorry")

sorry

In [2]:
lis = [{ "name" : "Nandini", "age" : 20},
{ "name" : "Manjeet", "age" : 20 },
{ "name" : "Nikhil" , "age" : 19 }]
lis.sort(key =lambda i:(i["age"],i["name"]))
print (lis)

[{'name': 'Nikhil', 'age': 19}, {'name': 'Manjeet', 'age': 20}, {'name': 'Nandini', 'age': 20}]

In [19]:
f=open("file3.txt","r")
try:
    f.write("hi rahool i will kill you")
except:
    print("not writable")

not writable

In [18]:
f=open("file1.txt","w")
f.write("hi rahool i will kill you")
f.close()
f=open("file1.txt","a")
f.write(" and take all your money")
f=open("file1.txt","r")
f.read()

'hi rahool i will kill you and take all your money'

In [36]:
import pandas as pd
import numpy as np

# crete a sample dataframe
data1 = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

# view the data
data1

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [40]:
data1.loc[(data1.age >= 21)]
data1

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [56]:
data1.loc[(data1.age >= 10),['city','gender']]

      city gender
0  Gurgaon      M
1    Delhi      F
2   Mumbai      F
3    Delhi      M
4   Mumbai      M
5    Delhi      M
6   Mumbai      F

In [24]:
import pandas as pd
import numpy as np

data=pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'], 'Year' : [2012, 2014, 2011, 2015, 2012,
2016, 2014, 2018, 2019], 'KmsDriven' : [50000, 30000, 60000,
25000, 10000, 46000,
31000, 15000, 12000], 'City' : ['Gurgaon', 'Delhi', 'Mumbai',
'Delhi', 'Mumbai', 'Delhi',
'Mumbai','Chennai', 'Ghaziabad'], 'Mileage' : [28, 27, 25, 26, 28,
29, 24, 21, 24]})
data

      Brand  Year  KmsDriven       City  Mileage
0    Maruti  2012      50000    Gurgaon       28
1   Hyundai  2014      30000      Delhi       27
2      Tata  2011      60000     Mumbai       25
3  Mahindra  2015      25000      Delhi       26
4    Maruti  2012      10000     Mumbai       28
5   Hyundai  2016      46000      Delhi       29
6   Renault  2014      31000     Mumbai       24
7      Tata  2018      15000    Chennai       21
8    Maruti  2019      12000  Ghaziabad       24

In [29]:
data.loc[(data.Mileage>=20) & (data.Brand=='Maruti')]

    Brand  Year  KmsDriven       City  Mileage
0  Maruti  2012      50000    Gurgaon       28
4  Maruti  2012      10000     Mumbai       28
8  Maruti  2019      12000  Ghaziabad       24

In [45]:
data.iloc[1:5,3:6]

     City  Mileage
1   Delhi       27
2  Mumbai       25
3   Delhi       26
4  Mumbai       28

In [47]:
import pandas as pd
import numpy as np

data2=pd.DataFrame({'age':[30, 2, 12, 4, 32, 33, 69], 
                      'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'], 
                      'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'], 
                      'height':[165, 70, 120, 80, 180, 172, 150], 'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2], 
                      'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX'] }, 
                     index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'])

In [48]:
data2

           age  color    food  height  score state
Jane        30   blue   Steak     165    4.6    NY
Nick         2  green    Lamb      70    8.3    TX
Aaron       12    red   Mango     120    9.0    FL
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX
Cornelia    69    red   Beans     150    2.2    TX